Тест1/src/Catalogs/ИнвентарныеНомера/ИнвентарныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвентарныеНомера</name>
  <owners>Catalog.СкладСнабжение</owners>
  <owners>Catalog.ТМЦВорктрак</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТМЦВорктрак</types>
      <types>DocumentRef.ПоступлениеТМЦСкладСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнвентарногоНомераТМЦ</name>
    <type>
      <types>EnumRef.СтатусыИнвентарныхНомеровТМЦ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/CommonModules/РаботаСДокументамиТМЦВызовСервера/Module.bsl
#Область ОбработчикиСобытийФормы
	
#КонецОбласти


#Область ОбработчикиКомандФормы
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьАналитикуСтоимости(Ссылка) Экспорт
	
	///+ГомзМА 27.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СРЕДНЕЕ(ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Цена)  КАК СредняяСтоимость,
		|	МИНИМУМ(ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Цена)  КАК СамаяНизкаяСтоимость,
		|	МАКСИМУМ(ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Цена) КАК СамаяВысокаяСтоимость
		|ИЗ
		|	Документ.ПоступлениеТМЦСкладСнабжение.СписокТМЦ КАК ПоступлениеТМЦСкладСнабжениеСписокТМЦ
		|ГДЕ
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.ТМЦ = &ТМЦ
		|	И ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ТМЦ", Ссылка);

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеТМЦСкладСнабжение", "ПоступлениеТМЦВорктрак");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса;
	
	///-ГомзМА 27.04.2023

КонецФункции

&НаСервере
Функция ПолучитьКоличествоТМЦ(ИнвентарныйНомер) Экспорт
	
	///+ГомзМА 11.05.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦСкладСнабжениеОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.ТипУчета КАК ТипУчета,
		|	ДвижениеТМЦСкладСнабжениеОстатки.ТМЦ КАК ТМЦ
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦСкладСнабжение.Остатки(&Дата, ) КАК ДвижениеТМЦСкладСнабжениеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТМЦСкладСнабжение.СписокТМЦ КАК ПоступлениеТМЦСкладСнабжениеСписокТМЦ
		|		ПО ДвижениеТМЦСкладСнабжениеОстатки.ИнвентарныйНомер.ДокументПоступления = ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Ссылка.Ссылка
		|ГДЕ
		|	ДвижениеТМЦСкладСнабжениеОстатки.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("Дата", 			  ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
 
	Если ТипЗнч(ИнвентарныйНомер.Владелец) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПоступлениеТМЦСкладСнабжение", "ПоступлениеТМЦВорктрак");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СкладСнабжение", "Ворктрак");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.КоличествоОстаток;
	///-ГомзМА 11.05.2023

КонецФункции


&НаСервере
Функция  ПолучениеКодаТМЦ(ТМЦ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладСнабжение.Код КАК Код
	               |ИЗ
	               |	Справочник.СкладСнабжение КАК СкладСнабжение
	               |ГДЕ
	               |	СкладСнабжение.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТМЦ);
	
	Если ТипЗнч(ТМЦ) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СкладСнабжение", "ТМЦВорктрак"); 
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Код;
	
КонецФункции


&НаСервере
Функция ПолучитьСерийныйНомер(ТекСтрокаИнвентарныйНомер) Экспорт

	///+ГомзМА 13.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.СерийныйНомер;
	///-ГомзМА 13.04.2023

КонецФункции


&НаСервере
Функция ПолучитьТМЦ(ТекСтрокаИнвентарныйНомер) Экспорт

	///+ГомзМА 26.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Владелец КАК ТМЦ
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.ТМЦ;
	///-ГомзМА 26.04.2023

КонецФункции


&НаСервере
Функция ПолучитьСтоимостьТМЦ(ТекСтрокаИнвентарныйНомер) Экспорт

	///+ГомзМА 26.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Стоимость КАК Стоимость
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Стоимость;
	///-ГомзМА 26.04.2023

КонецФункции


&НаСервере
Функция ПолучитьМестоХранения(ТекСтрокаИнвентарныйНомер) Экспорт

	///+ГомзМА 26.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦСкладСнабжениеОстатки.МестоХранения КАК МестоХранения
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦСкладСнабжение.Остатки(&Дата, ) КАК ДвижениеТМЦСкладСнабжениеОстатки
		|ГДЕ
		|	ДвижениеТМЦСкладСнабжениеОстатки.ИнвентарныйНомер = &Ссылка
		|	И ДвижениеТМЦСкладСнабжениеОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтрокаИнвентарныйНомер);
	Запрос.УстановитьПараметр("Дата", 	ТекущаяДатаСеанса());
	
	Если ТипЗнч(ТекСтрокаИнвентарныйНомер.Владелец) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДвижениеТМЦСкладСнабжение", "ДвижениеТМЦВорктрак");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.МестоХранения;
	///-ГомзМА 26.04.2023

КонецФункции

&НаСервере
Процедура УдалитьСтрокиТабличнойЧасти(ДокОбъект, Ссылка) Экспорт
	
	///+ГомзМА 17.05.2023
	СтруктураДляПоиска = Новый Структура("Основание", Ссылка);
	ТЧДокОбъект = ДокОбъект.ТМЦ;
	
	МассивСтрокДляУдаления = ТЧДокОбъект.НайтиСтроки(СтруктураДляПоиска);
	Для каждого Строка Из МассивСтрокДляУдаления Цикл
		ТЧДокОбъект.Удалить(Строка);						
	КонецЦикла;
	///-ГомзМА 17.05.2023

КонецПроцедуры


&НаСервере
Функция ПолучитьСуммуКоличестваЗадубленныхСтрок(ДокументПоступления, ИнвентарныйНомер) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктрак.Регистратор КАК Регистратор,
		|	ДвижениеТМЦВорктрак.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктрак.Количество КАК Количество
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак КАК ДвижениеТМЦВорктрак
		|ГДЕ
		|	ДвижениеТМЦВорктрак.ИнвентарныйНомер = &ИнвентарныйНомер
		|	И ДвижениеТМЦВорктрак.Регистратор = &ДокументПоступления";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", 		ИнвентарныйНомер);
	Запрос.УстановитьПараметр("ДокументПоступления", 	ДокументПоступления); 
	
	Если ТипЗнч(ИнвентарныйНомер.Владелец) = Тип("СправочникСсылка.СкладСнабжение") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДвижениеТМЦВорктрак", "ДвижениеТМЦСкладСнабжение");	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Результат = 0;
	Если РезультатЗапроса.Количество() > 1 Тогда
		Пока РезультатЗапроса.Следующий() Цикл
			Результат = Результат + РезультатЗапроса.Количество;	
		КонецЦикла;
		Возврат Результат;
	Иначе
		Возврат Результат;
	КонецЕсли;


КонецФункции // ПолучитьСуммуКоличестваЗадубленныхСтрок()


#КонецОбласти
